SeraphimlabsLLC/Arch_Bridge/Software/Arch_Bridge/ESP32_Loconet.cpp
/*   IMPORTANT:nge
 *  Some of the message formats used in this code are Copyright Digitrax, Inc.
 */
#ifndef ESP32_LOCONET_H
  #include "ESP32_Loconet.h"
#endif
 
#ifndef ESP32_UART_H
  #include "ESP32_uart.h"
#endif
#ifndef ESP32_DCCEX_H
  #include "ESP32_dccex.h"
  extern DCCEX_Class dccex;
#endif
#ifndef ESP32_TIMER_H
  #include "ESP32_timer.h" //For gptimer and fastclock access
  ESP_gptimer LN_gptimer; //Timer handle owned by this instance
  extern Fastclock_class Fastclock; 
#endif

#ifndef ESP32_ADC_H
  #include "ESP32_adc.h"
#endif
 

ESP_Uart LN_port; //Loconet uart object
LN_Class Loconet; //Loconet processing object
TaskHandle_t LNtask; //Loconet task object

volatile uint64_t LN_cd_edge = 0; //time_us of last edge received. 


//extern DCCEX_Class dccex_port;
extern uint64_t time_us;

//extern ADC info
extern ADC_Handler adc_one[ADC_SLOTS];
 

void LN_init(){//Initialize Loconet objects
  LN_gptimer.gptimer_init(); //Initialize ESP gptimer for collision detection
  LN_UART //Initialize uart 
  Loconet.LN_port.uart_mode = 0; //Change to 1 to use uart fast write
  Loconet.LN_set_mode(LN_HOSTMODE); //set default host mode
  Loconet.ln_adc_index = ADC_new_handle();
  //Serial.printf("Loconet railsync adc handle %i \n", Loconet.ln_adc_index); 
  adc_one[Loconet.ln_adc_index].adc_channel_config(LN_ADC_GPIO, LN_ADC_OFFSET, LN_ADC_OL * LN_ADC_SCALE, 2, 0); //Reserve ADC handle. Mode 2 for current < threshold, instance 0
  Loconet.last_ol_time = 0; //prime the overload warning timer
  Loconet.adc_ticks_scale = LN_ADC_SCALE; //ADC ticks to volts, instead of mA. 
  LN_gptimer.alarm_set(-1, 1);//alarm set to where it would take an absurd amount of time to trip. The first edge interrupt to make rx_pin = 1 will lower it. 
  Loconet.line_flags = 0;
  attachInterrupt(Loconet.LN_port.rx_pin, LN_CD_isr, CHANGE); //Attach the pcint used for CD
  xTaskCreatePinnedToCore(LN_task, "lntask", 20000, NULL, 2, &LNtask, 1); 
  return;
}

void LN_loop(){//reflector into LN_Class::loop_Process()
  //Loconet.loop_process(); //Process and update Loconet
  xTaskNotify(LNtask, LN_lineflags::ln_hrt, eSetBits); //LNtask bit 8 for heartbeat scan
  return; 
}

void LN_task(void * pvParameters){
  while (true){
    Loconet.loop_process(); //Process and update Loconet
  } //while
  return; 
}

void LN_Class::loop_process(){
  uint32_t notifications = 0; 
  xTaskNotifyWait(0, 0xffffffff, &notifications, 1000); //blocks until a notification is pending, copies into notifications and clears
  if (notifications > 0) {
  //  Serial.printf("Loconet loop process notification %i, line_flags %i\n", notifications, line_flags);
  }
  
  if (notifications & LN_lineflags::link_disc) { //disconnect detected. 
    line_flags = line_flags & ~(LN_lineflags::link_active); //unset link_active
    Serial.printf("Loconet lost connection to network \n");
  }

  if (notifications & LN_lineflags::link_active) { //Been at least 250mS since a 1 was detected, try to connect.
    Serial.printf("Loconet: connected to network \n");  
    line_flags = line_flags | LN_lineflags::link_active; //set link_active
    line_flags = line_flags & ~(LN_lineflags::link_disc); //Unset link_disconected
    uart_rx(); //read data from buffer
    LN_port.rx_read_processed = 255; //discard read data 
    rx_pending = -1; 
    tx_pending = -1; 
  } 

  if (!(line_flags & LN_lineflags::link_active)) { 
    //network is not up, clear buffers and return. 
    uart_rx(); //read data from buffer
    LN_port.rx_read_processed = 255; //discard read data 
    //Loconet starter
    if ((!(line_flags & LN_lineflags::link_disc)) && (gpio_get_level(gpio_num_t(Loconet.LN_port.rx_pin)) == 1)) {
      Serial.printf("Loconet: loop starting gptimer \n");
      LN_gptimer.alarm_set(250000, 1); //Sets the alarm with an initial count of 0. 
      Loconet.line_flags = Loconet.line_flags | LN_lineflags::link_disc; //reuse link_disc for the restart timer    
    } 
    return; 
  }

  if ((notifications & LN_lineflags::rx_brk) || (line_flags & LN_lineflags::rx_brk))  { //RX Break was set. 
    if (line_flags & LN_lineflags::rx_brk) {
      line_flags = line_flags & ~(LN_lineflags::rx_brk); //Unset rx_break
      Serial.printf("Loconet: RX Break from ISR \n");
      //receive_break(); 
    }
  }
  if ((notifications & LN_lineflags::tx_brk) || (line_flags & LN_lineflags::tx_brk)) { //TX Break was set.
    if (line_flags & LN_lineflags::tx_brk) {
      line_flags = line_flags & ~(LN_lineflags::tx_brk); //Unset tx_brk
      Serial.printf("Loconet: TX Break complete, line_flags %i \n", line_flags);
    }
  }
  if (notifications & LN_lineflags::rx_recv) { //RX Data
  }
  if (notifications & LN_lineflags::tx_snd) { //TX Data
    if (tx_pending > 0) {//pending packet, try to send it
      tx_send(tx_pending);
    }
  } 
  uart_rx(); //Read uart data into the RX ring
  rx_scan(); //Scan RX ring for an opcode
  //Network is up but no notifications were received. Process the queues. 
  rx_queue(); //Process queued RX packets and run rx_decode
  tx_queue(); //Try to send any queued packets
  slot_queue(); //Clean up stale slots
  #if FCLK_ENABLE == true //Only include the poller if the fastclock should be enabled. If false, the clock won't broadcast. 
  if (Fastclock.active == true) {
    if (!(slot_ptr[123])){ //Initialize fastclock slot if it doesn't exist yet. 
      slot_new(123);
    }
    if ((time_us - slot_ptr[123]->last_refresh) > slot_ptr[123]->next_refresh) { //Broadcast time 
      slot_read(123); //Broadcast Fast clock
    } 
  }
  #endif 
  //Serial.printf("Loconet loop complete \n");
  return;
} 

/*void LN_Class::network_startup(){
  uint64_t gptimer_count = LN_gptimer.gptimer_read(); //Get gptimer count since last edge
  Serial.printf("Loconet network status gptimer_count %lu \n", gptimer_count);

  //Initial startup. 
  if ((gpio_get_level(LN_port.rx_pin) == 1) && (((line_flags & LN_lineflags::link_disc) == 0))){
    if (gptimer_count >= 250000) {
//    if (((TIME_US - signal_time) > 250000)) { 
      signal_time = TIME_US; 
      line_flags = line_flags | LN_lineflags::link_disc; //signal ok
      #if LN_DEBUG == true
        Serial.printf("Loconet master detected \n");
      #endif
    } 
    return;
  }
  //Activate connection if port is enabled and link is up. 
  if (gpio_get_level(LN_port.rx_pin) == 1) {
    if ((gptimer_count >= 100000) && (((line_flags & LN_lineflags::link_disc) == 1))) {
      if ((line_flags & LN_lineflags::link_active) == 1) {
        line_flags = line_flags | LN_lineflags::link_active; //set to link active  
      }  
    }
  }
  //Check for loss of master connection. Will reset the link if rx_pin is 0 and has not changed in 100mS. 
  if (gpio_get_level(LN_port.rx_pin) == 0) {
    if (gptimer_count >= 100000) {
//    if (TIME_US - signal_time > 100000) {
      if (line_flags & LN_lineflags::link_active) {
        line_flags = line_flags & ~LN_lineflags::link_active; //set to disconnected
        //detachInterrupt(Loconet.LN_port.rx_pin); //Turn off ISR 
        Serial.printf("Loconet lost connection to master. Resetting link state. \n"); 
      }
      return; 
    }
  }
  return; 
} */

uint8_t LN_Class::uart_rx(){
  uint8_t read_size = 0;
  uint8_t i = 0;

  if (LN_port.rx_read_processed != 255) { //Data processing incomplete, don't read more.  
    return 0; 
  }
  LN_port.rx_read_data[i] = 0; 
  read_size = LN_port.uart_read(read_size); //populate rx_read_data and rx_data
  LN_port.rx_flush(); //Clear the uart after reading. 
  LN_port.rx_read_len = read_size; //Just to be sure it is correct. 
  return read_size;
}

void LN_Class::rx_scan(){ //Scan received data for a valid frame
  uint8_t rx_byte = 0; 
  int8_t coll = 0;  
  time_us = TIME_US; //update time_us
  //Serial.printf("rx_scan LN_port.rx_read_processed %u \n", LN_port.rx_read_processed);
  if (LN_port.rx_read_processed != 0) { //Data has already been processed. 
    return; 
  }
  //Serial.printf("RX_Scan processing %u bytes, pending %i \n", LN_port.rx_read_len, rx_pending);
  for (rx_byte = 0; rx_byte < LN_port.rx_read_len; rx_byte++) {
    //Serial.printf("RX_Scan For, rx_pending %i, rxbyte %x, counter rx_byte %u \n", rx_pending, LN_port.rx_read_data[rx_byte], rx_byte);

//Detect opcode and packet start if there isn't already a packet open
    if (LN_port.rx_read_data[rx_byte] & 0x80) { //rx_byte will only ever have the MSB set on opcodes 
      rx_pending = rx_packet_getempty(); //Get handle of next open packet
      //Serial.printf("Starting new packet %i with opcode %x \n", rx_pending, LN_port.rx_read_data[rx_byte]);
      rx_packets[rx_pending]->state = 1; //Packet is pending data
      rx_packets[rx_pending]->rx_count = 0; //1st byte in packet. 
      rx_packets[rx_pending]->xsum = 0;
      rx_packets[rx_pending]->last_start_time = time_us; //Time this opcode was found
    }
    //Sanity Block: No packet active or packet not in pending or attempting state
    if ((rx_pending < 0) || (rx_packets[rx_pending]->state == 0) || (rx_packets[rx_pending]->state > 2)) {
      //Serial.printf("Not in packet or packet state not ok, going back to for with rx_byte %u and read_len %u \n", rx_byte, LN_port.rx_read_len);
      rx_pending = -1; 
      continue;
    }
     
