SeraphimlabsLLC/Arch_Bridge/Software/Arch_Bridge/ESP32_Loconet.cpp
//Populate packet:      
    uint64_t time_remain = (15000 - (time_us - rx_packets[rx_pending]->last_start_time));
    //Serial.printf("RX_Scan Processing byte %x from packet %u. ", LN_port.rx_read_data[i], rx_pending);
    //Serial.printf("RX_Scan Time remaining (uS): %u \n", time_remain);
    if ((time_us - rx_packets[rx_pending]->last_start_time) > 15000) { //Packets must be fully received within 15mS of opcode detect
      //Serial.printf("RX Timeout, dropping %u bytes from slot %u \n", rx_packets[rx_pending]->rx_count, rx_pending);
      rx_packets[rx_pending]->state = 4; //Set state to failed
      rx_packets[rx_pending]->last_start_time = time_us;
      rx_pending = -1; //Stop processing this packet.  
      continue; //Skip the rest of this loop and start the next from while
    } 

    //Copy RX byte into packet. 
    rx_packets[rx_pending]->data_ptr[rx_packets[rx_pending]->rx_count] = LN_port.rx_read_data[rx_byte]; //Copy the byte being read
    //Serial.printf("Copying data %x position %u in packet %u \n", rx_packets[rx_pending]->data_ptr[rx_packets[rx_pending]->rx_count], rx_packets[rx_pending]->rx_count, rx_pending);
    LN_port.rx_read_data[rx_byte] = 0; //Set the byte we just read to 0. Not strictly necessary, but to prevent duplicate reads. 

    //Check packet length once it becomes possible to. 
    if ((rx_packets[rx_pending]->rx_count) == 1){ //Fix packet size now that both bytes 0 and 1 are present 
      rx_packets[rx_pending]->packet_size_check();
      rx_packets[rx_pending]->state = 2; //Packet being received now has known size, change to state 2. 
      //Serial.printf("RX_Scan Packet Size set to %u \n", rx_packets[rx_pending]->data_len); 
    }
    rx_packets[rx_pending]->rx_count++;  
    
    //Packet isn't finished yet. Next iteration. 
    if ((rx_packets[rx_pending]->rx_count) < (rx_packets[rx_pending]->data_len)) {
      //Serial.printf("RX_Scan Packet Size %u, needs %u \n", rx_packets[rx_pending]->rx_count, rx_packets[rx_pending]->data_len); 
      continue; 
    }
    //Serial.printf("RX_Scan full packet %u with size %u has bytes %u \n", rx_pending, rx_packets[rx_pending]->data_len, rx_packets[rx_pending]->rx_count);
    //Packet is the length it should be. 
    #if LN_DEBUG == true
      show_rx_packet(rx_pending);
    #endif

//TX Loopback processing: 
    if (tx_pending > -1) { //rx_pending must be > -1 at this point. && (rx_pending > -1)) { 
      coll = tx_loopback(); 
      if (coll == 0) { //Check if the data so far matches what we sent. On match, mark both as success. 
        tx_pending = -1; 
        
        continue;
      }
      Serial.printf("TX Loopback had %i differences. rx_pending %i, tx_pending %i \n", coll, rx_pending, tx_pending);  
       
    }   
    if (rx_packets[rx_pending]->state == 2) {   
      rx_packets[rx_pending]->last_start_time = TIME_US; //Time it was set to this state.   
      if (rx_packets[rx_pending]->Read_Checksum()) { //Valid checksum, mark as received. 
        //Serial.printf("RX_Scan Completed packet %u ready to decode \n", rx_pending); 
        rx_packets[rx_pending]->state = 3; //Set state to received 
      } else {//Checksum was invalid. Drop the packet. 
        Serial.printf("RX_Scan Failed packet %u, RX checksum invalid \n", rx_pending); 
        rx_packets[rx_pending]->state = 4; //Set state to failed
      }
    }
    rx_pending = -1; 
  }
  LN_port.rx_read_processed = 255; //Mark as fully processed.
  LN_port.rx_read_len = 0;  
  //Serial.printf("RX_Scan Complete \n");
  return; 
} //::rx_scan()  

void LN_Class::rx_queue(){ //Loop through the RX queue and process all packets in it. 
  uint8_t i = 0;
  uint8_t complete = 0;
  uint8_t priority = 255; //Maximum of 20, the out of bounds init means no packet was matched. 
  uint8_t rx_next_decode = 0; 
  time_us = TIME_US;
  for (i = 0; i < LN_RX_Q; i++){
    //Serial.printf("RX_Queue. rx_next_check = %u, LN_RX_Q = %u \n", rx_next_check, LN_RX_Q);
    if (rx_packets[rx_next_check]) { //Packet exists, check it.
      //Serial.printf("Queue Processing RX packet %u, state is %u \n", rx_next_check, rx_packets[rx_next_check]->state);
      switch (rx_packets[rx_next_check]->state) {
        case 1:
        case 2:
          if (time_us - rx_packets[rx_next_check]->last_start_time > 15000) { //Pending or Attempting must be finished within 15mS since their state last changed.
            //Serial.printf("RX_Q Cleaning up incomplete packet %u \n", rx_next_check);
            rx_packets[rx_next_check]->reset_packet();
            if (rx_next_check == rx_pending) {
              rx_pending = -1;
            } 
          }          
          break;
        case 3: 
          if (rx_packets[rx_next_check]-> priority <= priority) { //New most urgent packet. 
            //Serial.printf("RX_Q: Next packet to decode: %u \n", rx_next_check);
            rx_next_decode = rx_next_check;
            priority = rx_packets[rx_next_decode]-> priority; 
          }
          break; 
        case 5:
          //LN_port.uart_rx_flush(); //Failed packet. 
        case 4: 
          //Serial.printf("RX_Q Cleaning up complete or failed packet %u \n", rx_next_check);
          rx_packets[rx_next_check]->reset_packet(); 
          if (rx_next_check == rx_pending) {
              rx_pending = -1;
          }
      }
    }
    rx_next_check++;
    if (rx_next_check >= LN_RX_Q){
      rx_next_check = 0; 
    }
  }

  if ((priority < 21) && (rx_packets[rx_next_decode])) { //A packet was in state 3 and had lowest priority. Ifit still exists, process it. 
    //Serial.printf("RX_Q Before rx_decode of %u \n", rx_next_decode);
    complete = rx_decode(rx_next_decode); 
    //Serial.printf("RX_Q After rx_decode of %u \n", rx_next_decode);
    if (complete == 0) {
      rx_packets[rx_next_decode]->state == 5; //Completed. Can delete it on next cycle. 
    }    
  }
  return;
}

int8_t LN_Class::rx_decode(uint8_t rx_pkt){  //Opcode was found. Lets use it.
  //Finally processing the packet.
  //Serial.printf("Processing received packet from RX_Q slot %u \n", rx_pkt);
  if (!(rx_packets[rx_pkt])) { //An invalid handle was given. Abort. 
    return -1; 
  }

  measure_time_start();
  char opcode = rx_packets[rx_pkt]->data_ptr[0];
  uint8_t i = 0;
  int8_t slotnum= -1; //Used for slot processing. 
  rx_packets[rx_pkt]->state = 5;
  //show_rx_packet(rx_pkt); //display packet for debug
  switch (opcode) {
    
    //2 byte opcodes:
    case 0x81:  //Master Busy
      break;
    case 0x82: //Global power off
      Serial.print("Loconet: Power off requested \n"); 
      LN_TRK = LN_TRK & 0xFE; //Set power bit off in TRK byte
      dccex.global_power('0', DCCEX_TO_LN); //power off, announce to DCCEX if true
      break;
    case 0x83: //Global power on
      Serial.print("Loconet: Power on requested \n");
      LN_TRK = LN_TRK | 0x03; //Set power bit on in TRK byte, set estop release
      dccex.global_power('1', DCCEX_TO_LN); //power off, announce to DCCEX if true
      break;
    case 0x85: //Force idle, broadcast estop
      Serial.print("Loconet: <!> \n"); //DCC-EX Estop
      LN_TRK = LN_TRK & 0xFD; //Clear estop bit for global estop. 
       dccex.global_power('!', DCCEX_TO_LN); //estop, announce to DCCEX if true
      break; 
      
    //4 byte opcodes: 
    case 0xA0: //Set slot speed
      slotnum = rx_packets[rx_pkt]->data_ptr[1];
      if (!(slot_ptr[slotnum])) { //Invalid slot, do nothing. 
        break; 
      }
      //if (slot_ptr[slotnum].
      slot_ptr[slotnum]->slot_data[2] = rx_packets[rx_pkt]->data_ptr[2]; //Update speed byte
      slot_ptr[slotnum]->last_refresh = TIME_US;
      #if DCCEX_TO_LN == true //Only send if allowed to.
        dccex.tx_cab_speed(slot_ptr[slotnum]->slot_data[1] + uint16_t (slot_ptr[slotnum]->slot_data[6] << 7),
        slot_ptr[slotnum]->slot_data[2], bool(~(slot_ptr[slotnum]->slot_data[3]) & 0x20)); //Extract dir bit
      #endif
      break;
    case 0xA1: //Set slot dirf
      slotnum = rx_packets[rx_pkt]->data_ptr[1];
      if (!(slot_ptr[slotnum])) { //Invalid slot, do nothing. 
        break; 
      }
      slot_ptr[slotnum]->slot_data[3] = rx_packets[rx_pkt]->data_ptr[2]; //Update dirf byte
      slot_ptr[slotnum]->last_refresh = TIME_US;
      #if DCCEX_TO_LN == true //Only send if allowed to.
        dccex.tx_cab_speed(slot_ptr[slotnum]->slot_data[1] + uint16_t (slot_ptr[slotnum]->slot_data[6] << 7), 
        slot_ptr[slotnum]->slot_data[2], bool(~(slot_ptr[slotnum]->slot_data[3]) & 0x20)); 
      #endif       
      break;
    case 0xA2: //Set slot sound
      slotnum = rx_packets[rx_pkt]->data_ptr[1];
      if (!(slot_ptr[slotnum])) { //Invalid slot, do nothing. 
        break; 
      }
      slot_ptr[slotnum]->slot_data[3] = rx_packets[rx_pkt]->data_ptr[7]; //Update sound byte
      slot_ptr[slotnum]->last_refresh = TIME_US; 
      break;      
    case 0xB0: //REQ SWITCH function
      rx_req_sw(rx_pkt);
      break;
    case 0xB1: //Turnout SENSOR state REPORT
      break;  
    case 0xB2: //General SENSOR Input codes
      break;       
    case 0xB4: //Long acknowledge 
      
      break;         
    case 0xB5: //WRITE slot stat1
      slotnum = rx_packets[rx_pkt]->data_ptr[1];
      if (!(slot_ptr[slotnum]) || (slotnum > 120)) { //Invalid slot, do nothing. 
        break; 
      }
      slot_ptr[slotnum]->slot_data[0] = rx_packets[rx_pkt]->data_ptr[2]; //Update stat1 byte
      slot_ptr[slotnum]->last_refresh = TIME_US;      
      break;   
    case 0xB6: //SET FUNC bits in a CONSIST uplink elemen
      break; 

      break;  
    case 0xB9: //LINK slot ARG1 to slot ARG
      break;  
    case 0xBA: //MOVE slot SRC to DEST
    //0xB8 to 0xBF require replies
    case 0xB8: //UNLINK slot ARG1 from slot ARG2
      #if LN_DEBUG == true
        Serial.printf("Slot move %u to %u \n", rx_packets[rx_pkt]->data_ptr[1], rx_packets[rx_pkt]->data_ptr[2]); 
      #endif
      slotnum = slot_move(rx_packets[rx_pkt]->data_ptr[1], rx_packets[rx_pkt]->data_ptr[2]); //Process slot data move
      if (slotnum < 0) { //No free slot found. Send LACK fail. 
        send_long_ack(0xBA, 0);
        break;
      } else {
        slot_read(slotnum); //Read the modified data from dest
      }
      break; 
    case 0xBB: //Request SLOT DATA/status block
      slotnum = rx_packets[rx_pkt]->data_ptr[1];
      #if LN_DEBUG == true
        Serial.printf("Throttle requesting slot %u data \n", slotnum);
      if (slotnum > 120) {
        show_rx_packet(rx_pkt); 
      }
      #endif
      slot_read(slotnum); //Read slot data out to Loconet  
      break; 
    case 0xBC: //REQ state of SWITCH. LACK response 7F for ok. 
    case 0xBD: //REQ SWITCH WITH acknowledge function (not DT200
      //send_long_ack(0xBD, 0x7F); 
      break;
    case 0xBF: //;Request Locomotive Address
      slotnum = loco_select(rx_packets[rx_pkt]->data_ptr[1], rx_packets[rx_pkt]->data_ptr[2]); //0xBF addr_h, addr_l, chk 
      if (slotnum < 0) { //No free slot found. Send LACK fail. 
        send_long_ack(0xBF, 0);
        break;
      }
      #if LN_DEBUG == true
        Serial.printf("Request for loco %u found/set in slot %u \n", rx_packets[rx_pkt]->data_ptr[2], slotnum);
      #endif
      //slot_data[0] already set to free if this is a new assignment 
      slot_ptr[slotnum] -> slot_data[1] = rx_packets[rx_pkt]->data_ptr[2];
      slot_ptr[slotnum] -> slot_data[6] = rx_packets[rx_pkt]->data_ptr[1];
      slot_read(slotnum); //Read the slot back to the source. 
    
      break;                                   
    //6 byte opcodes, none known as of Oct 2023: 

    //Variable byte opcodes: 
    case 0xE7: //Slot read data
      slotnum = rx_packets[rx_pkt]->data_ptr[2];
      if (!(slot_ptr[slotnum])) { //Invalid slot, do nothing. 
        break; 
      }
      if (slotnum == 123) { //Set fast clock using sync from some other device. 
        slot_fastclock_set(rx_pkt);
      }
      //slot_read(slot_read);
      break;
    case 0xED: //Send Immeadiate Packet
      send_long_ack(0xED, 0); //Busy response
      break; 
    case 0xEF: //Slot write data
    
      slotnum = slot_write(rx_packets[rx_pkt]->data_ptr[2], rx_pkt); //Accept slot write data and send Long Ack
      send_long_ack(0xEF, slotnum); //Send LACK with the result
      break; 
    
    default: 
    #if LN_DEBUG == true
      Serial.printf("No match for %x \n", rx_packets[rx_pkt]->data_ptr[0]);
    #endif
    rx_packets[rx_pkt]->state = 4;
  }
  measure_time_start();
  return 0;
}

void LN_Class::tx_queue(){ //Try again to send queued packets on each loop cycle
  uint8_t i = 0;
  uint8_t priority = 255; //max allowed is actually 20, so this is out of bounds to indicate no packet matched. 
  uint8_t tx_next_send = 0;
  time_us = TIME_US;

  //Serial.printf("TX_Q priority loop \n");
  //while (priority <= LN_min_priority){ 
  //  while (i < LN_TX_Q) {
  for (i = 0; i < LN_TX_Q; i++) {
  //Serial.printf("TX_Q. priority = %u i = %u, tx_next_check %u, LN_TX_Q = %u \n", priority, i, tx_next_check, LN_TX_Q);  
    if (tx_packets[tx_next_check]) { //Packet exists, check it.
      //Serial.printf("TX_Q Processing TX packet %u, state is %u \n", tx_next_check, tx_packets[tx_next_check]->state);
      time_us = TIME_US; //Update time
      switch (tx_packets[tx_next_check]->state) {
        case 0: //No action needed, empty slot. 
          break; 
        case 1: //Pending. 
          if (tx_packets[tx_next_check]->priority < priority) {
            //Serial.printf("TX_Q: Try sending packet %i \n", tx_next_check);
            priority = tx_packets[tx_next_check]->priority;
            tx_next_send = tx_next_check;
          }
          break; 
        case 2: //Attempting. Check if valid state and within 15mS window
          if (tx_next_check != tx_pending) {  //A packet in this state that doesn't match tx_pending is a problem.
            tx_packets[tx_next_check]->state = 4;
            break;
          } 
          if ((time_us - tx_packets[tx_next_check]->last_start_time) < 15000) { //Still within 15mS window, try tx_send again to see if cooldown has passed.
            Serial.printf("TX_Q: Re-check send packet %i %i \n", tx_pending, tx_next_check); 
            priority = 0;
            tx_next_send = tx_next_check;
           
          } else { //15mS exceeded since start of window, mark as failed. 
            Serial.printf("TX_Q tx_next_check failed to send after %u mS. %u attempts remain \n", (time_us - tx_packets[tx_next_check]->last_start_time) / 1000, tx_packets[tx_next_check]->tx_attempts);
            tx_packets[tx_next_check]->state = 4;
            tx_packets[tx_next_check]->tx_attempts--;
            tx_packets[tx_next_check]->priority--; //Increase priority for the next attempt.
          if (tx_packets[tx_next_check]->priority < LN_max_priority) {//Enforce priority limit
              tx_packets[tx_next_check]->priority = LN_max_priority;
            }
            if (tx_next_check == tx_pending) {
              tx_pending = -1;
            }
          }
          break; 
        case 3: //Sent. 
          if ((time_us - tx_packets[tx_next_check]->last_start_time) > TX_SENT_EXPIRE) { //Packet was sent long enough ago loopback should have seen it by now if it arrived ok. Clear it out if it still exists. 
            tx_packets[tx_next_check]->state = 4;
            tx_packets[tx_next_check]->tx_attempts = 0;
            Serial.printf("TX_Q Purging stale sent packet %u ", tx_next_check);
            Serial.printf("after %u uS \n", (time_us - tx_packets[tx_next_check]->last_start_time));
            tx_packets[tx_next_check]->reset_packet(); 
            if (tx_next_check == tx_pending) {
              Serial.printf("TX_Q Purged pending packet. This should not happen \n");
              tx_pending = -1;
            } 
          }
          break; 
        case 4: //Failed. 
          if (tx_packets[tx_next_check]->tx_attempts <= 0) {
            //Serial.printf("TX_Q Unable to transmit packet from TX queue index %u, dropping. \n", tx_next_check);
            tx_packets[tx_next_check]->reset_packet();     
            if (tx_next_check == tx_pending) {
              tx_pending = -1;
            }
          } else { //Packet still has retries left. 
            if (tx_packets[tx_next_check]->priority < priority) {
            priority = tx_packets[tx_next_check]->priority;
            tx_next_send = tx_next_check;
            }
          }
          break;  
        case 5: //Success? Either way we don't need it anymore.
          show_tx_packet(tx_next_check); 
          tx_packets[tx_next_check]->reset_packet(); 
          if (tx_next_check == tx_pending) { //This should never be needed, but just in case. 
              tx_pending = -1;
          }
        }
      } //endif packet exists
      tx_next_check++; 
      if (tx_next_check >= LN_TX_Q){ 
        tx_next_check = 0; 
      }
  }
  if (priority < 21) { //Send best priority packet if one was found
    if ((tx_pending < 0) || (tx_pending == tx_next_send)) { //Clear to try sending or already are sending
      //tx_pending = tx_next_send;  
      tx_send(tx_next_send);
      }
  }
  
  return;
}

