SeraphimlabsLLC/Arch_Bridge/Software/Arch_Bridge/ESP32_Loconet.cpp
void LN_Class::tx_send(uint8_t txptr){
  //Note: tx_priority from LN_Class needs to be replaced by per-packet priority handling. 
  time_us = TIME_US;
  uint8_t i = 0;
  uint16_t rx_len = 0;
  if (!tx_packets[txptr]) { //If the handle is invalid, abort.
    return; 
  }
  
  if ((time_us - tx_packets[txptr]->last_start_time) < (tx_pkt_len * LN_BITLENGTH_US * 8)) {//There is likely data already being sent. Don't add more.
  //  Serial.printf("LN_TX Buffer should still have data, send wait \n");
    return;    
  }

  rx_len = LN_port.read_len(); //Check if data has been received since the last read. Don't send now if it has. 
  if (rx_len > 0) {
    return; 
  }

  if (LN_host_mode == ln_silent) { //Silent mode, transmitter disabled. 
    tx_packets[txptr]->state = 5; //Set to complete so that it gets dropped.
    if (txptr == tx_pending) { //Clear pending if it was this packet. 
      tx_pending = -1;
    }
    return; 
  }
  
   //Serial.printf("TX_Send Pending Packet %u has mark %u \n", txptr, tx_packets[txptr]->state);
  if ((tx_packets[txptr]->state == 1) || (tx_packets[txptr]->state == 4)) { //Packet is pending or failed. Mark attempting.
    tx_packets[txptr]->last_start_time = time_us;
    tx_packets[txptr]->state = 2; //Attempting
    //Serial.printf("TX_Send Packet %u changed from 1 or 4 to  %u \n", txptr, tx_packets[txptr]->state);
  }
  
  //if ((time_us - rx_last_us) > (LN_BITLENGTH_US * (tx_packets[txptr]->priority + LN_COL_BACKOFF))) {
  //Use LN_cd_time from the ISR instead of rx_last_us because of the rx buffer uncertainty
  uint64_t LN_cd_timer = LN_gptimer.gptimer_read(); //Get gptimer count since last edge
  Loconet.LN_cd_window = (LN_BITLENGTH_US * (tx_packets[txptr]->priority + LN_COL_BACKOFF));

  if (((LN_cd_timer) > Loconet.LN_cd_window) && (gpio_get_level(gpio_num_t(Loconet.LN_port.rx_pin)) == 1)) { 
    //if the last edge was longer than the cd interval, and rx_pin is high indicating an idle bus
  //if ((TIME_US - LN_cd_edge) > (LN_BITLENGTH_US * (tx_packets[txptr]->priority + LN_COL_BACKOFF))) {
    //Serial.printf("Sending packet %u \n", txptr); 
    tx_pending = txptr; //Save txpending for use in tx_loopback
    i = 0;
    tx_pkt_len = tx_packets[txptr]->data_len; //Track how much data is to be sent for overrun prevention.
    if (tx_packets[txptr]->state == 2) { //Only send if it isn't in state attempting. 
      char writedata[tx_pkt_len]; 
      #if LN_DEBUG == true
      Serial.printf("Transmitting %u: ", tx_pending);
      while (i < tx_pkt_len){ 
        writedata[i] = tx_packets[txptr]->data_ptr[i];
        Serial.printf("%x ", tx_packets[txptr]->data_ptr[i]);
        i++;
     }
      Serial.printf("\n"); 
      #endif
      tx_packets[txptr]->last_start_time = time_us;  
      
      //LN_port.uart_write(writedata, tx_pkt_len);
      LN_port.uart_write(tx_packets[txptr]->data_ptr, tx_pkt_len);   
      tx_packets[txptr]->state = 3; //sent
      Loconet.LN_cd_window = 850; //Reset to RX break interval
      line_flags = line_flags | LN_lineflags::tx_snd; //indicate that transmission started
    }
  } else { //CD window wasn't ready or rx_pin wasn't in the wrong state. Set tx_rts.
    line_flags = line_flags | LN_lineflags::tx_rts;
    LN_gptimer.alarm_change(Loconet.LN_cd_window, 2); //set timer for the cd interval
  }
  return;
}

uint8_t LN_Class::tx_loopback(){
  uint8_t delta = 0;
  uint8_t i = 0;
  //Serial.printf("Loopback rx_pending %i : %i tx_pending \n", rx_pending, tx_pending);  
  //Serial.printf("RX Packet, %u bytes:", rx_packets[rx_pending]->rx_count);
  while (i <= rx_packets[rx_pending]->rx_count) {
    //Serial.printf(" %x", rx_packets[rx_pending]->data_ptr[i]);
    i++;
  }
  //Serial.printf(" \nTX Packet, %u bytes:", tx_packets[tx_pending]->data_len);
  i = 0; 
  while (i <= tx_packets[tx_pending]->data_len) {
    //Serial.printf(" %x", tx_packets[tx_pending]->data_ptr[i]);
    i++;
  }
  //Serial.printf("\n");
  i = 0;
  //Serial.printf("Comparing rx : tx for %u bytes \n", rx_packets[rx_pending]->rx_count);
  while ((i < rx_packets[rx_pending]->rx_count) && (i < tx_packets[tx_pending]->data_len)) {
    //Serial.printf(" %x:%x ", rx_packets[rx_pending]->data_ptr[i], tx_packets[tx_pending]->data_ptr[i]);
    if (rx_packets[rx_pending]->data_ptr[i] != tx_packets[tx_pending]->data_ptr[i]){ //Compare rx data to tx data
      Serial.printf("\n Found difference %x:%x at position %u \n", rx_packets[rx_pending]->data_ptr[i], tx_packets[tx_pending]->data_ptr[i], i);
      delta++;   
    }
    i++;  
  }
  //Serial.printf("\n"); 
 
  if (delta == 0) {//No differences in the data given
    if (rx_packets[rx_pending]->rx_count == tx_packets[tx_pending]->data_len) { //Packet is complete and intact. 
//        Serial.printf("Transmission of packet %d confirmed in %d \n", tx_pending, rx_pending);
        tx_packets[tx_pending]->state = 5; //Mark TX complete
        tx_packets[tx_pending]->last_start_time = TIME_US; //Time it was set to this state.
        line_flags = line_flags & ~(LN_lineflags::tx_snd); //Transmission ended  
        tx_pending = -1;        
        rx_packets[rx_pending]->state = 5; //Mark RX complete
        rx_packets[rx_pending]->last_start_time = TIME_US; //Time it was set to this state.   
    }
    return delta;
  } else { //Collision. Transmit break, drop from rx_packet, and decrement tx_attempts to drop if stale.  
//    Serial.printf("Collision detected, %u differences found. \n", delta);
    //transmit_break();
    tx_packets[tx_pending]->tx_attempts--; 
    tx_packets [tx_pending]->state = 4; 
    line_flags = line_flags & ~(LN_lineflags::tx_snd); //Transmission ended
    //tx_pending = -1;
    //if (rx_packets[rx_pending]->rx_count == rx_packets[rx_pending]->data_len) { //If the complete packet is here, drop from rx_pending
    rx_packets[rx_pending]->state = 4;
      //rx_pending = -1;
    //} 
  }
  return delta;
}

void LN_Class::Overload_Check(int32_t current, int32_t overload){
  if (current < overload) { //Voltage below threshold. Warn the user. 
    if ((TIME_US - last_ol_time) > 10000000) {
      Serial.printf("Loconet railsync voltage low %u mV, required %u mV \n", current / Loconet.adc_ticks_scale, overload / Loconet.adc_ticks_scale);
      last_ol_time = TIME_US; 
    }
  }
  return; 
}

void IRAM_ATTR LN_CD_isr(){ //Pin change ISR has around 4uS latency. 
  //bool rx_pin_state = ~(gpio_get_level(gpio_num_t(LN_COLL_PIN)));
  bool cd_pin = gpio_get_level(gpio_num_t(Loconet.LN_port.rx_pin));
  //uint8_t i = 0; 
  uint64_t gptimer_count = LN_gptimer.gptimer_read(); 
  //Serial.printf("%u-%llu ", cd_pin, gptimer_count);
  if (!(Loconet.line_flags & LN_lineflags::link_active)){  //link is not active, if cd_pin became 1, start the timer. 
    if (cd_pin  == 1) {
      if (!(Loconet.line_flags & LN_lineflags::link_disc)) {
        LN_gptimer.alarm_set(250000, 1); //Sets the alarm with an initial count of 0. 
        Loconet.line_flags = Loconet.line_flags | LN_lineflags::link_disc; //reuse link_disc for the restart timer
        //Serial.printf("LNCD disc set \n");
      }
      //LN_gptimer.alarm_change(250000, 1); //time the 250mS from the 1st detected 1.
      //Serial.printf("LN_CD_ISR_inactive_count\n");  
    }
    return; 
  } else {   //link is active, reset the timers. 
    LN_gptimer.gptimer_set(0); //set the timer count to 0. 
    LN_cd_edge = TIME_US;  //record current time
    //Serial.printf("LN_CD_ISR_active \n");
  }

  if (Loconet.line_flags & LN_lineflags::tx_snd) { //Transmitter should be active, watch for bitwise collision
   // if (cd_pin  == 0){ 
    if ((gpio_get_level(gpio_num_t(Loconet.LN_port.tx_pin))) && (gpio_get_level(gpio_num_t(Loconet.LN_port.rx_pin)))) {
      //Loconet.transmit_break(); 
      }
    return; 
  } 

  if (!(Loconet.line_flags & LN_lineflags::tx_brk))  { //TX_break not set
    if (cd_pin  == 0) { //Input is 0, check if this is break or disconnect.  
      //if (LN_gptimer.alarm_owner() != 2) { //alarm isn't currently set for break detection
        if (Loconet.line_flags & LN_lineflags::tx_rts)  {
          LN_gptimer.alarm_set(Loconet.LN_cd_window, 2); //watch for CD interval
        } else {
          LN_gptimer.alarm_set(850, 2); //fixed 850uS RX BREAK detect
        } 
      //}
    }
  }
  return; 
}
void IRAM_ATTR LN_gptimer_alarm(){//When triggered, check the source and act accordingly. 
  BaseType_t wakeup;
  wakeup = pdFALSE;
  uint64_t alarm_value = LN_gptimer.alarm_value(); //read the value we had set
  uint8_t owner = LN_gptimer.alarm_owner(); 
  bool cd_pin = gpio_get_level(gpio_num_t(Loconet.LN_port.rx_pin));
  //Serial.printf("gptalarm ct %lu %u pin %u \n", gptimer_count, owner, cd_pin); 

    if (owner == 3) { //BREAK was sent
      
      Loconet.LN_port.uart_invert(false, false); //Reset TX to normal
      //LN_cd_edge = TIME_US; //Record time in case ISR doesn't
      //Task will clear line_flags bit for TX break, don't do it here. 
      xTaskNotifyFromISR(LNtask, LN_lineflags::tx_brk, eSetBits, &wakeup); //LNtask bit 7 for end TX break
      //Serial.printf("Loconet timer mode 3 alarm \n"); 
      return;
    }
    if (owner == 2) { //Listening for CD window or RX Break
      //Serial.printf("Loconet timer mode 2 alarm count %u \n", alarm_value); 
      if ((alarm_value >= Loconet.LN_cd_window) && (cd_pin == 1) && (Loconet.line_flags & LN_lineflags::tx_rts)) { 
        //Value remained 1 for the entirety of the CD window
        LN_gptimer.alarm_change((100000), 1); //change to disconnect detection mode
        xTaskNotifyFromISR(LNtask, LN_lineflags::tx_cts, eSetBits, &wakeup); //TX clear to send
        return; 
      }
     
      if ((alarm_value >= 850) && (cd_pin == 0) && ((Loconet.line_flags & LN_lineflags::tx_brk) == 0)) { 
        //rx_pin was 0 for more than RX_break minimum, and we didn't send this break. 
        LN_gptimer.alarm_change((100000), 1); //change to disconnect detection mode
        //Serial.printf("Loconet Gptimer rx_break triggered \n"); 
        xTaskNotifyFromISR(LNtask, LN_lineflags::rx_brk, eSetBits, &wakeup); //RX break received
      } 
      return; 
    } 
     
