SeraphimlabsLLC/Arch_Bridge/Software/Arch_Bridge/ESP32_Loconet.cpp
    if (owner == 1) { //Network state mode
      alarm_value = LN_gptimer.gptimer_read(); 
      //Serial.printf("Loconet timer mode 1 alarm, gptimer %lu \n", gptimer_count); 
      if ((alarm_value >= 250000) && (!(Loconet.line_flags & LN_lineflags::link_active))) { //cold start or disconnected
        //Serial.printf("Loconet startup \n");
        xTaskNotifyFromISR(LNtask, LN_lineflags::link_active, eSetBits, &wakeup); //Network should become active. 
        return; 
      }
      if ((alarm_value >= 100000) && (cd_pin == 0)){
        //rx_pin was at 0 for more than the disconnect interval. Disconnect. 
        //Serial.printf("Loconet master lost \n");
        xTaskNotifyFromISR(LNtask, LN_lineflags::link_disc, eSetBits, &wakeup);
        return; 
      }  
    }
    
  return; 
}

void IRAM_ATTR LN_Class::transmit_break(){
  //Write 15 bits low for BREAK on collision detection.  
  Loconet.line_flags = Loconet.line_flags | LN_lineflags::tx_brk; //Transmit break
  Loconet.line_flags = Loconet.line_flags & ~(LN_lineflags::tx_snd); //Transmission ended
  Loconet.line_flags = Loconet.line_flags & ~(LN_lineflags::tx_rts); //Unset ready to send since buffers must flush.
  LN_port.uart_invert(true, false); //Invert TX to transmit Loconet BREAK 
  LN_gptimer.alarm_set(900, 3);//15 bit at 60us per bit. Owner tag 3. 
  return;
}

void LN_Class::receive_break(){ //Possible BREAK input at ptr. 
  LN_port.rx_flush();
  LN_port.tx_flush();
  line_flags = line_flags & ~(LN_lineflags::rx_brk); //Unset receive break flag
  //Serial.printf("Loconet: Received Break Input\n"); 
  return;
}

uint8_t LN_Class::rx_packet_getempty(){ //Scan rx_packets and return 1st empty slot
  uint8_t count = 0; 
  while (count < LN_RX_Q){  
    if (!rx_packets[rx_next_new]){ //Isn't initialized yet, fix this
      rx_packets[rx_next_new] = new LN_Packet();
    }
    if (rx_packets[rx_next_new]->state == 0) { //Exists and is marked empty, claim it.  
      break; //break out of the while loop and use this result. 
    }
    rx_next_new++; 
    if (rx_next_new >= LN_RX_Q) {
      rx_next_new = 0;
    }
    count++; 
  }
  if (count == LN_RX_Q) { //Checked all slots without a result
    Serial.printf("WARNING: rx_packets out of space. RX packet %d will be overwritten, consider increasing LN_RX_Q \n", rx_next_new);
  }
  rx_packets[rx_next_new]->reset_packet(); //Sets it to defaults again 
//  if (rx_next_new == rx_pending){ //Should not execute, but prevents crashes if this situation happens. 
//    rx_pending = -1;  
//  }
  return rx_next_new;
}

void LN_Class::rx_packet_del(uint8_t index){ //Delete a packet after it has been processed. 
  
  Serial.printf("Deleting rx_packets[%u]\n", index);
  delete rx_packets[index]; //Invokes the destructor
  rx_packets[index] = NULL; //This is necessary to prevent repeated deallocations. 
 
  return;
}

uint8_t LN_Class::tx_packet_getempty(){ //Scan tx_packets and return 1st empty slot above slot 1
  uint8_t count = 0;
  while (count < LN_TX_Q) {//Iterate through possible arrays
    if (!tx_packets[count]) {//Doesn't exist yet, we can take this slot.
      //Serial.printf("Found uninitialized slot tx_packets[%u]\n", count);
      tx_packets[count] = new LN_Packet();
      
    }
    if (tx_packets[count]->state == 0) { //Although it already exists, it is in the empty state. Claim it. 
      //Serial.printf("Reusing slot tx_packets[%u]\n", count);
        tx_packets[count]->reset_packet();
        if (count == tx_pending) { //Shouldn't happen but just in case. 
          tx_pending = -1;
        }
        return count; 
    }
    count++;
  }
  if (count == LN_TX_Q) { //Checked all slots without a result
    Serial.printf("WARNING: tx_packets out of space. TX packet %d will be overwritten, consider increasing LN_TX_Q \n", count);
  }
  return count;
}

void LN_Class::tx_packet_del(uint8_t index){ //Delete a packet after confirmation of sending
  Serial.printf("Deleting tx_packets[%u] \n", index);
  delete tx_packets[index];
  tx_packets[index] = NULL; //This is necessary to prevent repeated deallocations. 
  return;
}

void LN_Class::LN_set_mode(LN_hostmode newmode){ //Set current Loconet access mode
  //enum LN_hostmode {ln_master = 0x80, ln_sensor = 0x20, ln_throttle = 0x08, ln_silent = 0}; //Enum for operating level
  if (newmode > LN_HOSTMODE) {
    Serial.printf("Loconet: Attempt to change to a host mode above LN_HOSTMODE. \n"); 
    return; 
  }
  
  LN_host_mode = newmode;   
  switch (LN_host_mode) {
    case ln_master:
      LN_max_priority = 0; //maximum allowed priority for this mode
      LN_min_priority = 20; //minimum allowed priority for this mode
      Serial.printf("Loconet: Host mode set to master \n"); 
      break; 
    case ln_sensor:
      LN_max_priority = 2; //maximum allowed priority for this mode
      LN_min_priority = 6; //minimum allowed priority for this mode
      Serial.printf("Loconet: Host mode set to sensor \n"); 
      break;
    case ln_throttle:
      LN_max_priority = 6; //maximum allowed priority for this mode
      LN_min_priority = 20; //minimum allowed priority for this mode 
      Serial.printf("Loconet: Host mode set to throttle \n");  
      break;
    case ln_silent:  //Not allowed to send
      LN_max_priority = 127; 
      LN_min_priority = 127; 
      Serial.printf("Loconet: Host mode set to silent \n"); 
      break;   
    default: 
      Serial.printf("Loconet Host mode invalid %u \n", newmode);   
  }
  return;
}
LN_hostmode LN_Class::LN_get_mode(){ //Return current Loconet access mode
  return LN_host_mode;
}

void LN_Class::rx_req_sw(uint8_t rx_pkt){
  uint16_t addr = 0; 
  uint8_t cmd = 0; 
  addr = (((rx_packets[rx_pkt]->data_ptr[2]) & 0x0F) << 7) | (rx_packets[rx_pkt]->data_ptr[1] & 0x7F);
  cmd = ((rx_packets[rx_pkt]->data_ptr[2]) & 0xF0);
  Serial.printf("Loconet: Req switch addr %u direction %u, output %u \n", addr, (cmd & 0x20) >> 5, (cmd & 0x10) >> 4);
  #if DCCEX_TO_LN == true //Only send if allowed to. 
  //if (((cmd & 0x10) >> 4) == 1) { //only forward if output is on. 
    dccex.tx_req_sw(addr + 1, (cmd & 0x20) >> 5, (cmd & 0x10) >> 4); //Addr + 1 so the displayed values agree with commanded
  //}
  #endif

  return;
}

