SeraphimlabsLLC/Arch_Bridge/Software/Arch_Bridge/ESP32_Loconet.cpp
void LN_Class::tx_req_sw(uint16_t addr, bool dir, bool state){
  if (addr > 2043) { //Address not valid on Loconet. Don't forward it. 
    return; 
  }
  uint8_t tx_index; 
  uint8_t sw1 = addr & 0x7F; //Truncate to addr bits 0-6
  uint8_t sw2 = ((addr >> 8) & 0x0F) | (0x10 * state) | (0x20 * dir); //addr bits 7-10 | (state * 16) | (dir * 32)
  tx_index = tx_packet_getempty();
  tx_packets[tx_index]->state = 1;
  tx_packets[tx_index]->priority = LN_min_priority; 
  tx_packets[tx_index]->data_len = 4;
  tx_packets[tx_index]->data_ptr[0] = 0xB0; //REQ_SW
  tx_packets[tx_index]->data_ptr[1] = sw1; 
  tx_packets[tx_index]->data_ptr[2] = sw2; 
  tx_packets[tx_index]->Make_Checksum(); //Populate checksum  
  //Don't send this one right away, let it go through the queue. 
  return;
}

void LN_Class::rx_cab(){

  return;
}

void LN_Class::tx_cab_speed(uint16_t addr, uint8_t spd){
  /*  0x0 = STOP
   *  0x1 = ESTOP
   *  0x2-0x7F speed range */
  int8_t slotnum;
  uint8_t response_size = 4; //Both response packets are 4 bytes long
  uint8_t tx_index = tx_packet_getempty();

  slotnum = loco_select(uint8_t ((addr >> 7) & 0x7F), uint8_t (addr & 0x7F));

  if ((slot_ptr[slotnum]->slot_data[2] != spd) || ((TIME_US - slot_ptr[slotnum]->last_refresh) > 100000)) {
    //Slot data changed or was more than 100ms old, re-send. 
    slot_ptr[slotnum]->slot_data[0] | 0x30; //Set slot busy + slot active 
    slot_ptr[slotnum]->slot_data[2] = spd; //Update speed byte
    Serial.printf("LN_Class::tx_cab_speed cab %u updated with speed %u Preparing Loconet notification \n", addr, spd);

    tx_packets[tx_index]->priority = LN_max_priority; 
    tx_packets[tx_index]->data_len = response_size;
    tx_packets[tx_index]->data_ptr[0] = 0xA0; //OPC_LOCO_SPD
    tx_packets[tx_index]->data_ptr[1] = slotnum; 
    tx_packets[tx_index]->data_ptr[2] = spd;
    tx_packets[tx_index]->Make_Checksum(); //Populate checksum
    tx_packets[tx_index]->state = 1; //Mark as pending packet
    tx_packets[tx_index]->last_start_time = TIME_US;
    Serial.printf("LN_Class::tx_cab_speed ready to send updated throttle info for cab %u \n", addr);
    if (tx_pending == -1) { //Send now if possible. 
      tx_send(tx_index);
    } 
  }
  slot_ptr[slotnum]->next_refresh = 100000000; //100 seconds
  slot_ptr[slotnum]->last_refresh = TIME_US;
  return;
}
void LN_Class::tx_cab_dir(uint16_t addr, bool dir){
  int8_t slotnum;
  uint8_t dirf = dir * 0x20; 
  uint8_t response_size = 4; //response packets is 4 bytes long
  uint8_t tx_index = 0; 
  slotnum = loco_select(uint8_t ((addr >> 7) & 0x7F), uint8_t (addr & 0x7F));

  if ((slot_ptr[slotnum]->slot_data[3] != dirf) || ((TIME_US - slot_ptr[slotnum]->last_refresh) > 100000)) {
    //Slot data changed or was more than 100ms old, re-send. 
    slot_ptr[slotnum]->slot_data[0] | 0x30; //Set slot busy + slot active
    if (dirf == (slot_ptr[slotnum]->slot_data[3]) & 0x20){ //Refresh slot only, no need to update LN. 
      return; 
    }
    if (dirf == 0x20) {
      slot_ptr[slotnum]->slot_data[3] = slot_ptr[slotnum]->slot_data[3] | 0x20; //Set dir bit
    } else {    
      slot_ptr[slotnum]->slot_data[3] = slot_ptr[slotnum]->slot_data[3] & 0xDF; //Clear dir bit
    }
    tx_packets[tx_index]->priority = LN_max_priority; 
    tx_packets[tx_index]->data_len = response_size;
    tx_packets[tx_index]->data_ptr[0] = 0xA1; //OPC_LOCO_DIRF
    tx_packets[tx_index]->data_ptr[1] = slotnum; 
    tx_packets[tx_index]->data_ptr[2] = slot_ptr[slotnum]->slot_data[3];
    tx_packets[tx_index]->Make_Checksum(); //Populate checksum
    tx_packets[tx_index]->state = 1; //Mark as pending packet
    tx_packets[tx_index]->last_start_time = TIME_US;
    Serial.printf("LN_Class::tx_cab_dir ready to send updated throttle info for cab %u \n", addr);
    if (tx_pending == -1) { //Send now if possible. 
      tx_send(tx_index);
    }
  } 
  slot_ptr[slotnum]->next_refresh = 200000000; //200 seconds
  slot_ptr[slotnum]->last_refresh = TIME_US;
  return;  
}

void LN_Class::send_long_ack(uint8_t opcode, uint8_t response) {
  uint8_t tx_index; 
  tx_index = tx_packet_getempty();
  tx_packets[tx_index]->state = 1;
  tx_packets[tx_index]->priority = LN_min_priority;
  tx_packets[tx_index]->data_len = 4;
  tx_packets[tx_index]->data_ptr[0] = 0xB4; //Long Acknowledge
  tx_packets[tx_index]->data_ptr[1] = opcode & 0x7F; //Opcode being given LACK & 0x7F to unset bit 7. 
  tx_packets[tx_index]->data_ptr[2] = response & 0x7F; //Response & 0x7F to make sure bit 7 isn't set. 
  tx_packets[tx_index]->Make_Checksum(); //Populate checksum
  if (tx_pending < 0) { //Needs to send ASAP, so try to send now. 
    tx_send(tx_index); 
  }
  return; 
}

void LN_Class::show_rx_packet(uint8_t index) { //Display a packet's contents
  #if LN_DEBUG == true
    uint8_t i = 0; 
    uint8_t pkt_len = rx_packets[index]->rx_count; 
    Serial.printf("Loconet show RX Packet: ");
    while (i < pkt_len) {
      Serial.printf("%x ", rx_packets[index]->data_ptr[i]); 
      i++;
    }
    Serial.printf(" \n");
  #endif
  return; 
}
void LN_Class::show_tx_packet(uint8_t index) { //Display a packet's contents
  #if LN_DEBUG == true
    uint8_t i = 0; 
    uint8_t pkt_len = tx_packets[index]->data_len; 
    Serial.printf("Loconet show TX Packet: ");
    while (i < pkt_len) {
      Serial.printf("%x ", tx_packets[index]->data_ptr[i]); 
      i++;
    }
    Serial.printf(" \n");
  #endif
  return; 
}

void LN_Class::global_power(char state, bool announce){ //Track power bytes, echo to Loconet
  uint8_t tx_index; 
  char response = 0; 
  #if LN_DEBUG == true  
    Serial.printf("Loconet global_power sending state %c \n", state); 
  #endif
  switch (state) {
    case 48: //'0'
      response = 0x82; //power off
      LN_TRK = LN_TRK & 0xFE; //Set power bit off in TRK byte
      break;
    case 49: //'1'
      response = 0x83; //power on
      LN_TRK = LN_TRK | 0x03; //Set power bit on in TRK byte, set estop release
      break; 
    case 33: //'!'
      response = 0x85; //estop
      LN_TRK = LN_TRK & 0xFD; //Clear estop bit for global estop. 
      break;
    case 98: //'b'
      if (LN_host_mode == ln_master) { //Only the Loconet master is allowed to use OPC_BUSY
        response = 0x81; //busy
      } else {
        announce = false; 
        return; 
      }
      break;
    default:
      #if LN_DEBUG == true
        Serial.printf("Loconet: global_power received invalid character %c \n", state);
      #endif
      announce = false; 
      return; 
  }
  if (announce == true) {
    tx_index = tx_packet_getempty();
    tx_packets[tx_index]->state = 1;
    tx_packets[tx_index]->priority = LN_min_priority;
    tx_packets[tx_index]->data_len = 2;
    tx_packets[tx_index]->data_ptr[0] = response; 
    tx_packets[tx_index]->Make_Checksum(); //Populate checksum
    if (tx_pending < 0) { //Needs to send ASAP, so try to send now. 
      tx_send(tx_index); 
    }
  }
  return; 
}

LN_Class::LN_Class(){ //Constructor, initializes some values.
  time_us = TIME_US;
  rx_pending = -1;
  tx_pending = -1;
  rx_next_new = 0; 
  rx_next_check = 0;
  line_flags = 0; 
  LN_host_mode = ln_silent; //default to ln_silent 
  LN_max_priority = 127; 
  LN_min_priority = 127; 
  LN_TRK = 0x06; //Slot global TRK. 0x06 = Loconet 1.1 capable, track idle, power off. 
  return;
}

/****************************************
 * Loconet Packet (LN_Packet) functions *
 ****************************************/
uint8_t LN_Packet::packet_size_check(){ //Check that a packet has a valid size.
  uint8_t packet_size = 0;
  uint8_t i = 0;

  //Serial.printf("Input byte %x \n", data_ptr[0]);
  packet_size= data_ptr[0] & 0x60; //D7 was 1, check D6 and D5 for packet length
  i = packet_size>>4; //1 + packetsize >> 4 results in correct packet_size by bitshifting the masked bits
  packet_size = i + 2; //After shifting right 4 bytes, add 2

  if (packet_size >= 6) { //variable length packet, read size from 2nd byte.
    packet_size = data_ptr[1];
    if (packet_size > 127) { //Invalid packet, truncate to 2 bytes so it fails checksum and is discarded. 
      //Serial.printf("Packet_size_check: Invalid packet size %u \n", packet_size);
      packet_size = 2;  
    }   
  } 
  //Serial.printf("packet_size_check %u, data_len %u \n", packet_size, data_len);
    data_len = packet_size;
  return packet_size; 
}

