SeraphimlabsLLC/Arch_Bridge/Software/Arch_Bridge/ESP32_Loconet.cpp
void LN_Packet::Make_Checksum(){
  char xsum = 0xFF;
  uint8_t i = 0;
  //Serial.printf("Make Checksum: ");
  while (i < data_len - 1){ //The -1 is because the last byte is where we write the xsum to
    xsum = xsum ^ data_ptr[i];
    //Serial.printf("%x ", xsum);
    i++; 
  }
  data_ptr[data_len - 1] = xsum;  
  //Serial.printf(" \n"); 
  return;
}

bool LN_Packet::Read_Checksum(){
  char xsum = 0x00;
  uint8_t i = 0;
  i = 0;
  //Serial.printf("Read_Checksum: ");
  while (i < data_len){
    xsum = xsum ^ data_ptr[i];
    //Serial.printf("%x ", xsum);
    i++;
  }
 // Serial.printf("\n");
  
  if (xsum == 0xFF) {
    return true;
  }
  return false; 
}

void LN_Packet::reset_packet() {
  data_len = 127; 
  state = 0; 
  rx_count = 0;
  priority = 20; 
  tx_attempts = 3; //15 attempts to send before failed status
  return;
}

LN_Packet::LN_Packet (){ //Functionality moved to LN_Packet::Reset_Packet()
 state = 0; //Initialize to empty, change to new_packet after populating data
 data_len = 0; 
 return;
}

/*****************************************
 * Slot Manager (LN_Slot_data) Functions *
******************************************/

int8_t LN_Class::loco_select(uint8_t high_addr, uint8_t low_addr){ //Return the slot managing this locomotive, or assign one if new. 
  int8_t slotnum = -1; //Slot numbers < 0 indicate failure to find 
  uint8_t freeslotnum = 0; //First empty slot, we can note this while scanning for the address to save time
  uint8_t i; //Skip slot 0 since it is system data.

 //Note: If high_addr > 0 there may be bit shifting required between high_addr and low_addr
  
  for (i = 1; i < 120; i++) { //Scan slots 1-120 to see if this loco is known
    if (!(slot_ptr[i])){ //Slot has not been initialized.
      if (freeslotnum == 0) { //If this is the first unused or free slot, take note.
        freeslotnum = i; 
      }
      continue; 
    }
    if (((slot_ptr[i] -> slot_data[0] && 0x30) == 0) && (freeslotnum == 0)){ //Note first slot in free status
      freeslotnum = i;        
    }
    if ((slot_ptr[i] -> slot_data[1] == low_addr) && (slot_ptr[i] -> slot_data[6] == high_addr)) { //Found this loco, return result
      //Serial.printf("Found locomotive %u in slot number %u \n", low_addr, i);
      return i;
    }
  }
  //Didn't find that loco in an existing slot. Assign one for it.
  slotnum = freeslotnum;
  if (!(slot_ptr[slotnum])){ //Empty slot. Initialize it. 
    slot_new(slotnum); 
  }
    slot_ptr[slotnum] -> slot_data[0] = 3; //Slot status set to free, 128 step speed
    slot_ptr[slotnum] -> slot_data[1] = low_addr;
    slot_ptr[slotnum] -> slot_data[6] = high_addr;
  
  return slotnum;
}

void LN_Class::slot_read(int8_t slotnum){ //Handle slot reads
  uint8_t i = 0;
  uint8_t tx_index = 0;
  uint8_t response_size = 0;
  //Serial.printf("Slot_read %i \n", slotnum);
  slot_new(slotnum); //Initialize slot if it isn't already. 
  if (slotnum == 123) { //Update fast clock slot
    slot_fastclock_get(); 
  }
  if (slotnum == 124) { //Programmer not supported. 
    //Serial.printf("Loconet Programmer not supported. \n"); 
    send_long_ack(0x7F, 0x7F); 
    return; 
  }
  if (slotnum == 127) { //Read CS opsw data
    slot_opsw_get(); 
  }
  //Loconet response: 
  response_size = 14; //Packet is 14 bytes long, should be 0x0E
  tx_index = tx_packet_getempty();
  tx_packets[tx_index]->state = 1;
  tx_packets[tx_index]->priority = LN_max_priority; 
  tx_packets[tx_index]->data_len = response_size;
  //Serial.printf("Loconet: slot reply data: ");
  i = 0;
  for (i = 0; i < 10; i++) {
    tx_packets[tx_index]->data_ptr[i + 3] = slot_ptr[slotnum]->slot_data[i]; //Copy values from slot_low_data
    //Serial.printf("%x ", slot_ptr[slotnum]->slot_data[i]);
  }
  //Serial.printf(" \n");
  tx_packets[tx_index]->data_ptr[0] = 0xE7; //OPC_SL_RD_DATA
  tx_packets[tx_index]->data_ptr[1] = response_size; 
  tx_packets[tx_index]->data_ptr[2] = slotnum;
  tx_packets[tx_index]->data_ptr[7] = LN_TRK; //Loconet slot global status. Although slot_data[4] is defined, it isn't used. 
  //Serial.printf("Calculating checksum \n");
  tx_packets[tx_index]->Make_Checksum(); //Populate checksum
  i = 0;

  tx_packets[tx_index]->state = 1; //Mark as pending packet
  //Serial.printf("slot_read %i reply in txpacket %i, tx_pending %i \n", slotnum, tx_index, tx_pending); 
  if (tx_pending == -1) { //Send now if possible. 
    tx_send(tx_index);
  }
  return;
}
int8_t LN_Class::slot_write(int8_t slotnum, uint8_t rx_pkt){ //Handle slot writes
  uint8_t i = 0;
  uint8_t response_size = 4;
  uint8_t tx_index = 0;
  uint8_t ack = 0;
  if (!(slot_ptr[slotnum])) { 
    slot_new(slotnum); 
  }
  if (slotnum < 120) { 
    for (i = 0; i < 10; i++) {
      slot_ptr[slotnum]->slot_data[i] = rx_packets[rx_pkt]->data_ptr[i + 3]; //Copy values from slot_data
    }
    ack = 0x7f; //Find out what the correct ACK code is
  }
  if (slotnum == 123) { //Set fast clock
    slot_fastclock_set(rx_pkt); 
  }
  if (slotnum == 124) { //Programming session
    ack = 127; //Not implemented
  }
  if (slotnum == 127) { //Command Station OPSW settings
    slot_opsw_set(rx_pkt);  //Save opsw changes 
    ack = 0x6f; 
  }
  return ack;
}

int8_t LN_Class::slot_move(int8_t slot_src, int8_t slot_dest){ //Handle slot moves
  uint8_t i = 0;
  if (!(slot_ptr[slot_src])) { //Invalid source slot, do nothing. 
        return -1; 
      }
  if (!(slot_ptr[slot_dest])) { //Invalid dest slot, create it. 
        slot_new(slot_dest);  
      }      
  if (slot_src == 0) {//When activated it sets all locomotives to speed 0 functions off
    Serial.printf("Requested slot 0, this shouldn't happen so stop the train \n");
    for (i = 1; i < 120; i++){
      if (slot_ptr[i]) {
        slot_ptr[i]->slot_data[1] = (slot_ptr[i]->slot_data[1] & 0xDF) | 0x10  ; //Force slot to state common
        slot_ptr[i]->slot_data[2] = 0; //speed 0
        slot_ptr[i]->slot_data[3] = 0; //Direction and functions off
      }
    }
    return 0;    
  }
  if ((slot_src > 120) || (slot_dest > 120)) { //Not allowed to move slots above 120
    return -1;
  }
  
  if (slot_src == slot_dest) { //NULL MOVE, a throttle is claiming this slot for use
    //Set status to IN_USE and read back the result.  
    slot_ptr[slot_dest]->slot_data[1] | 0x20; //D5 to 11, IN_USE
    slot_ptr[slot_dest]->next_refresh = 200000000; //200 seconds
    slot_ptr[slot_dest]->last_refresh = TIME_US;
    return slot_dest;
  }

