SeraphimlabsLLC/Arch_Bridge/Software/Arch_Bridge/ESP32_Loconet.cpp
  return slot_dest;
}

void LN_Class::slot_fastclock_set(uint8_t rx_pkt){
  const uint8_t slotnum = 123;
  slot_ptr[slotnum]->last_refresh = TIME_US;
  slot_ptr[slotnum]->slot_data[9] = rx_packets[rx_pkt]->data_ptr[12]; //ID2
  slot_ptr[slotnum]->slot_data[8] = rx_packets[rx_pkt]->data_ptr[11]; //ID1
  slot_ptr[slotnum]->slot_data[7] = rx_packets[rx_pkt]->data_ptr[10]; //CLK_CTRL, valid data this is 32. 
  slot_ptr[slotnum]->slot_data[6] = rx_packets[rx_pkt]->data_ptr[9]; //Days
  slot_ptr[slotnum]->slot_data[5] = rx_packets[rx_pkt]->data_ptr[8]; //Hours
  slot_ptr[slotnum]->slot_data[4] = LN_TRK; //Global status byte. Not actually used here, set anyway just because. 
  slot_ptr[slotnum]->slot_data[3] = rx_packets[rx_pkt]->data_ptr[6]; //Minutes
  slot_ptr[slotnum]->slot_data[2] = rx_packets[rx_pkt]->data_ptr[5]; //Fractional minutes high
  slot_ptr[slotnum]->slot_data[1] = rx_packets[rx_pkt]->data_ptr[4]; //Fractional minutes low 
  slot_ptr[slotnum]->slot_data[0] = rx_packets[rx_pkt]->data_ptr[3]; //Rate

  //Frac_Mins to uS seconds conversion.  
  uint32_t frac_minutes_uS = 0; //frac_minutes converted to uS
  uint8_t s_seconds = 0; 
  if ((slot_ptr[slotnum]->slot_data[2] - 120) > 0) { //Minimum value is 120, which has a shorter period than 121-127
   frac_minutes_uS = (slot_ptr[slotnum]->slot_data[2] - 121) * 8388480 + 1245165; //rollovers from 121-127 + the shorter period of cycle 120
  } 
  frac_minutes_uS = frac_minutes_uS + (slot_ptr[slotnum]->slot_data[1] * 65535); 

  //Convert the uS to sec  s_seconds = minutes_rem_uS / 10000000;
  //uint8_t s_seconds = uint32_t(472440 * (127 - rx_packets[rx_pkt]->data_ptr[5])) / 1000000; 
  if (s_seconds > 59) { //Probable math error here, this works around it. 
    s_seconds = s_seconds - 60; 
  }
  #if LN_DEBUG == true
    Serial.printf("Loconet: Seconds set %i \n", s_seconds); 
  #endif
  Fastclock.clock_set(slot_ptr[slotnum]->slot_data[0], slot_ptr[slotnum]->slot_data[6], slot_ptr[slotnum]->slot_data[5] - slot_hours, slot_ptr[slotnum]->slot_data[3] - slot_minutes, s_seconds, 0);
  Fastclock.clock_get(); //Update clock values with new setpoint. 
  Serial.printf("Loconet: Fastclock set to day %u %u:%u:%u \n", Fastclock.days, Fastclock.hours, Fastclock.minutes, Fastclock.seconds);  
  return; 
}

void LN_Class::slot_fastclock_get(){
  const uint8_t slotnum = 123;
  uint8_t minsl = 0; 
  uint8_t minsh = 120;
  uint32_t frac_mins_uS = 0;
  //Serial.printf("Processing fast clock update. \n");
  Fastclock.clock_get(); //Update fastclock values
  //Convert minutes_rem_uS to frac_minsh and frac_minsl. 
  frac_mins_uS = Fastclock.minutes_rem_uS;
  if (frac_mins_uS > 1245165) { //Equivalent minsl count of 109 to 127, used for minsh cycle 0. 
    minsh++; 
    frac_mins_uS = frac_mins_uS - 1245165; 
  } else { 
    minsl = 109; //Prime minsl for the 1st loop
  }
  while (frac_mins_uS > 8388480) { //Equivalent minsl count of 0-127, used for cycles 1-7
    minsh++; 
    frac_mins_uS = frac_mins_uS - 8388480;
  }
  if (minsh > 127) { //Enforce high limit of 127. 
    minsh = 127; 
  }
  minsl = minsl + frac_mins_uS / 65535; //Divide out the remainder for minsl. 

  
  slot_ptr[slotnum]->last_refresh = time_us; //The existing global should have been set by Fastclock.clock_get(); 
/* //Leave the ID untouched, it is set when the clock is. 
  slot_ptr[slotnum]->slot_data[9] = 0x7F; //ID2, 0x7x = PC
  slot_ptr[slotnum]->slot_data[8] = 0x7F; //ID1, 0x7F = PC */
  if (slot_ptr[slotnum]->slot_data[7] == 0) { //Only change slot validity if it is invalid. 
    slot_ptr[slotnum]->slot_data[7] = 32; //Bit D6 = 1 for valid clock data  
  }
  
  slot_ptr[slotnum]->slot_data[6] = Fastclock.days; //Days since fast clock init
  slot_ptr[slotnum]->slot_data[5] = slot_hours + Fastclock.hours; //128 - 24
  slot_ptr[slotnum]->slot_data[4] = LN_TRK; //Global slot byte;
  slot_ptr[slotnum]->slot_data[3] = slot_minutes + Fastclock.minutes; //127 - 60 or 128 - 60 depending on DCS100 compat mode
  slot_ptr[slotnum]->slot_data[2] = minsh; //127 - Fastclock.minutes_rem_uS / 472441; //frac_minutes_us is the remaining uS after calculating minutes. FRAC_MINS_H, 0-127 tick count
  slot_ptr[slotnum]->slot_data[1] = minsl; //127 - (Fastclock.frac_minutes_uS - (slot_ptr[123]->slot_data[2] * 472441)) / 3872; //FRAC_MINS_L, 0-127 tick count
  slot_ptr[slotnum]->slot_data[0] = Fastclock.set_rate; //Clock multiplier
//  Serial.printf("Loconet: Fastclock slot checked, minutes %u, minsh %u, minsl %u \n", slot_ptr[slotnum]->slot_data[3], slot_ptr[slotnum]->slot_data[2], slot_ptr[slotnum]->slot_data[1]);  
  return; 
}

void LN_Class::slot_opsw_set(uint8_t rx_pkt){ //Write CS opsw data
  int i = 0; 
    //Serial.printf("Loconet: Saving opsw packet: ");
    for (i = 0; i < 10; i++) {
      slot_ptr[127]->slot_data[i] = rx_packets[rx_pkt]->data_ptr[i + 3]; //Copy values from slot_data
      //Serial.printf("%x ", slot_ptr[127]->slot_data[i]);
    }
   //Serial.printf(" \n");
   if ((slot_ptr[127]->slot_data[5] & 0x40) == 0x40) { //OPSW 39 memory reset active
    slot_new(127); //Reinitialize slot 127 
    Serial.printf("Loconet: CS opsw data reset to defaults \n"); 
   }
  //Opsw bit locking, prevent incompatible/unsupported options from being selected
  slot_ptr[127]->slot_data[6] & 0x0A; //opsw 42, disable beep on purge. opsw 44, 120 slots.
  slot_ptr[127]->slot_data[5] & 0x07; //opsw 36 - 39 are memory resets. When not impemented, keep them set to off. 
  slot_ptr[127]->slot_data[2] & 0x77; //opsw 20 address 0 not allowed. opsw 21-23 are step modes,
  
  //TODO: Save slot 127 data to eeprom or filesystem
  Serial.printf("Loconet: CS opsw data written \n"); 
   return;
}

void LN_Class::slot_opsw_get(){//Read CS opsw data
  //TODO: Read slot 127 data from eeprom or filesystem
  Serial.printf("Loconet: opsw byte 0 has value %x \n", slot_ptr[127]->slot_data[0]);
  Serial.printf("Loconet: CS opsw data read \n"); 
  return;
}

int8_t LN_Class::slot_new(uint8_t slotnum) { //Initialize empty slots
  if (!(slot_ptr[slotnum])){ //Only create it when it doesn't already exist
    //Serial.printf("Initializing Loconet slot %u \n", slotnum);
    slot_ptr[slotnum] = new LN_Slot_data; 
    if (!(slot_ptr[slotnum])){
      Serial.printf("Failure allocating slot %u \n", index);
      return -1; 
    }
  }  
  slot_ptr[slotnum] -> slot_data[0] = 0; //Slot status set to free.
  slot_ptr[slotnum]->last_refresh = TIME_US;
  slot_ptr[slotnum]->next_refresh = 200000000; //Expect refresh within 200 seconds 
    
  //Implement special slot initialization / stored value reset
  if (slotnum == 123) { //Fast Clock
    slot_ptr[slotnum]->last_refresh = 0; //last refresh of 0 forces initial load quickly.   
    slot_ptr[slotnum]->next_refresh = 90000000; //Fastclock sends pings around every 80-100 seconds instead of receiving within 200. 
    slot_ptr[slotnum]->slot_data[9] = 0x70; //ID2, 0x7x = PC
    slot_ptr[slotnum]->slot_data[8] = 0x7F; //ID1, 0x7F = PC
  }
  if (slotnum == 127) { //OPSW slot
    //Placeholder: JMRI gave a DCS100 OPSW write as Loconet RX Packet: ef e 7f 10 0 8 0 6 0 8 0 0 0 77 
    slot_ptr[slotnum]->slot_data[0] = 0x10; //0x02 = opsw 2, booster only. 0x010 = opsw 5, CS Master mode
    slot_ptr[slotnum]->slot_data[1] = 0x00;
    slot_ptr[slotnum]->slot_data[2] = 0x08;  
    //Byte 02 opsw 20, Address 0 stretching. Forced off. opsw 21-23 fx and step mode. 0x10 on for FX enabled. 
    slot_ptr[slotnum]->slot_data[3] = 0x00;  //0x02 is opsw 26 C, enable routes
    slot_ptr[slotnum]->slot_data[4] = 0x06; //0x01 = opsw 25 disable alias, 0x02 = opsw 26 enable routes, 0x04 = opsw 27 bushby bit
    slot_ptr[slotnum]->slot_data[5] = 0x00;  
    //Byte 05: opsw36 consist reset = 0x08, opsw37 route reset = 0x10, opsw38 roster reset = 0x20
    //opsw39 all memory reset = 0x40
    slot_ptr[slotnum]->slot_data[6] = 0x0A;  //0x02 = opsw 42 C, disable beep on purge. 0x08 = opsw 44 C, 120 slots
    slot_ptr[slotnum]->slot_data[7] = 0x00;
    slot_ptr[slotnum]->slot_data[8] = 0x00;
    slot_ptr[slotnum]->slot_data[9] = 0x00;
  }
  return slotnum;
}


uint8_t LN_Class::slot_del(uint8_t index) {
  delete slot_ptr[index];
  return 0; 
}

void LN_Class::slot_queue() { //Scan slots and purge inactive
  int i; 
  time_us = TIME_US; 
  for (i = 1; i < 120; i++) {
    if (!(slot_ptr[i])){ //Undefined slot. Skip it. 
      continue; 
    }
    if ((time_us - slot_ptr[i]->last_refresh > slot_ptr[i]->next_refresh) && (slot_ptr[i]->slot_data[0] & 0x30)) { //Time expired. See if it can be purged. 
      slot_ptr[i]->slot_data[0] = slot_ptr[i]->slot_data[0] & 0xEF; //Unset SL_Active, leaving the slot in Idle or Free state. 0xDF to unset SL_Busy
                  
    }
    
  }
  return;   
}

LN_Slot_data::LN_Slot_data(){ //Constructor
  uint8_t i = 0;
  while (i < 10) {
    slot_data[i] = 0; 
    i++;
  }
  time_us = TIME_US;
  last_refresh = time_us;
  
  return;
}

LN_Slot_data::~LN_Slot_data(){ //Destructor

  return;
}
